; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport city-sequential-5nodes-1000size-5degree-100mindistance-3trucks-4packages-680seed

(define (problem transport-city-sequential-5nodes-1000size-5degree-100mindistance-3trucks-4packages-680seed)
 (:domain transport)
 (:objects
  city-loc-1 - location
  city-loc-2 - location
  city-loc-3 - location
  city-loc-4 - location
  city-loc-5 - location
  truck-1 - vehicle
  truck-2 - vehicle
  truck-3 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 871,602 -> 627,501
  (road city-loc-2 city-loc-1)
  (= (road-length city-loc-2 city-loc-1) 27)
  ; 627,501 -> 871,602
  (road city-loc-1 city-loc-2)
  (= (road-length city-loc-1 city-loc-2) 27)
  ; 136,830 -> 627,501
  (road city-loc-3 city-loc-1)
  (= (road-length city-loc-3 city-loc-1) 60)
  ; 627,501 -> 136,830
  (road city-loc-1 city-loc-3)
  (= (road-length city-loc-1 city-loc-3) 60)
  ; 818,848 -> 627,501
  (road city-loc-4 city-loc-1)
  (= (road-length city-loc-4 city-loc-1) 40)
  ; 627,501 -> 818,848
  (road city-loc-1 city-loc-4)
  (= (road-length city-loc-1 city-loc-4) 40)
  ; 818,848 -> 871,602
  (road city-loc-4 city-loc-2)
  (= (road-length city-loc-4 city-loc-2) 26)
  ; 871,602 -> 818,848
  (road city-loc-2 city-loc-4)
  (= (road-length city-loc-2 city-loc-4) 26)
  ; 524,861 -> 627,501
  (road city-loc-5 city-loc-1)
  (= (road-length city-loc-5 city-loc-1) 38)
  ; 627,501 -> 524,861
  (road city-loc-1 city-loc-5)
  (= (road-length city-loc-1 city-loc-5) 38)
  ; 524,861 -> 871,602
  (road city-loc-5 city-loc-2)
  (= (road-length city-loc-5 city-loc-2) 44)
  ; 871,602 -> 524,861
  (road city-loc-2 city-loc-5)
  (= (road-length city-loc-2 city-loc-5) 44)
  ; 524,861 -> 136,830
  (road city-loc-5 city-loc-3)
  (= (road-length city-loc-5 city-loc-3) 39)
  ; 136,830 -> 524,861
  (road city-loc-3 city-loc-5)
  (= (road-length city-loc-3 city-loc-5) 39)
  ; 524,861 -> 818,848
  (road city-loc-5 city-loc-4)
  (= (road-length city-loc-5 city-loc-4) 30)
  ; 818,848 -> 524,861
  (road city-loc-4 city-loc-5)
  (= (road-length city-loc-4 city-loc-5) 30)
  (at package-1 city-loc-5)
  (at package-2 city-loc-3)
  (at package-3 city-loc-3)
  (at package-4 city-loc-4)
  (at truck-1 city-loc-3)
  (capacity truck-1 capacity-4)
  (at truck-2 city-loc-2)
  (capacity truck-2 capacity-3)
  (at truck-3 city-loc-4)
  (capacity truck-3 capacity-3)
 )
 (:goal (and
  (at package-1 city-loc-3)
  (at package-2 city-loc-2)
  (at package-3 city-loc-5)
  (at package-4 city-loc-5)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (pick-up truck-3 city-loc-4 package-4 capacity-2 capacity-3)
   deleted: (at package-4 city-loc-4) (capacity truck-3 capacity-3)
   added: (in package-4 truck-3) (capacity truck-3 capacity-2)
   goals met: 0 of 4
2. (drive truck-3 city-loc-4 city-loc-5)
   deleted: (at truck-3 city-loc-4)
   added: (at truck-3 city-loc-5)
   goals met: 0 of 4
3. (pick-up truck-3 city-loc-5 package-1 capacity-1 capacity-2)
   deleted: (at package-1 city-loc-5) (capacity truck-3 capacity-2)
   added: (in package-1 truck-3) (capacity truck-3 capacity-1)
   goals met: 0 of 4
4. (pick-up truck-1 city-loc-3 package-3 capacity-3 capacity-4)
   deleted: (at package-3 city-loc-3) (capacity truck-1 capacity-4)
   added: (in package-3 truck-1) (capacity truck-1 capacity-3)
   goals met: 0 of 4
5. (pick-up truck-1 city-loc-3 package-2 capacity-2 capacity-3)
   deleted: (at package-2 city-loc-3) (capacity truck-1 capacity-3)
   added: (in package-2 truck-1) (capacity truck-1 capacity-2)
   goals met: 0 of 4
6. (drop truck-3 city-loc-5 package-4 capacity-1 capacity-2)
   deleted: (in package-4 truck-3) (capacity truck-3 capacity-1)
   added: (at package-4 city-loc-5) (capacity truck-3 capacity-2)
   goals met: 1 of 4
7. (drive truck-3 city-loc-5 city-loc-3)
   deleted: (at truck-3 city-loc-5)
   added: (at truck-3 city-loc-3)
   goals met: 1 of 4
8. (drive truck-1 city-loc-3 city-loc-5)
   deleted: (at truck-1 city-loc-3)
   added: (at truck-1 city-loc-5)
   goals met: 1 of 4
9. (drop truck-1 city-loc-5 package-3 capacity-2 capacity-3)
   deleted: (in package-3 truck-1) (capacity truck-1 capacity-2)
   added: (at package-3 city-loc-5) (capacity truck-1 capacity-3)
   goals met: 2 of 4
10. (drive truck-1 city-loc-5 city-loc-2)
   deleted: (at truck-1 city-loc-5)
   added: (at truck-1 city-loc-2)
   goals met: 2 of 4
11. (drop truck-1 city-loc-2 package-2 capacity-3 capacity-4)
   deleted: (in package-2 truck-1) (capacity truck-1 capacity-3)
   added: (at package-2 city-loc-2) (capacity truck-1 capacity-4)
   goals met: 3 of 4
12. (drop truck-3 city-loc-3 package-1 capacity-2 capacity-3)
   deleted: (in package-1 truck-3) (capacity truck-3 capacity-2)
   added: (at package-1 city-loc-3) (capacity truck-3 capacity-3)
   goals met: 4 of 4
